Today we'll cover the following basic data structures in Pandas:

1. [Series](#Series)
2. [DataFrame](#DataFrame)
3. [Panel](#Panel)

In [1]:
# Import modules
import numpy as np
import pandas as pd
import sys

In [2]:
# Print versions of Python and modules using which this notebook was built
print 'Python version ' + sys.version
print 'Numpy version: ' + np.__version__
print 'Pandas version: ' + pd.__version__

Python version 2.7.10 |Anaconda 2.3.0 (x86_64)| (default, May 28 2015, 17:04:42)
[GCC 4.2.1 (Apple Inc. build 5577)]
Numpy version: 1.9.2
Pandas version: 0.16.2

# Series

A pandas Series object is like a fixed length dict mapping the `index` values to the corresponding data values.

In [3]:
country_pops_dict = {'China': 1.37e+09, 'India': 1.28e+09, 'USA': 322e+06, 
                     'Indonesia': 257e+06, 'Brazil': 205e+06, 'Pakistan': 191e+06,
                     'Nigeria': 183e+06, 'Bangladesh': 159e+06, 'Russia': 147e+06,
                     'Japan': 127e+06}

In [4]:
country_pops = pd.Series(country_pops_dict)  # creates a Pandas Series from Python dict

In [5]:
print country_pops

Bangladesh     159000000
Brazil         205000000
China         1370000000
India         1280000000
Indonesia      257000000
Japan          127000000
Nigeria        183000000
Pakistan       191000000
Russia         147000000
USA            322000000
dtype: float64

However, Series objects are also numpy array-like: you can select a value or set of values.

In [6]:
country_pops['Japan']  # get one data value

127000000.0

In [7]:
country_pops[['USA', 'Russia']]  # get multiples values from indices

USA       322000000
Russia    147000000
dtype: float64

In [8]:
country_pops / 1e6  # in millions

Bangladesh     159
Brazil         205
China         1370
India         1280
Indonesia      257
Japan          127
Nigeria        183
Pakistan       191
Russia         147
USA            322
dtype: float64

In [9]:
country_pops[country_pops > 1e9]  # countries with population over a billion

China    1370000000
India    1280000000
dtype: float64

In [10]:
country_area_dict = {'Russia': 1.708e+07,  # areas in sq km of 10 largest countries
                    'Canada': 9.985e+06, 
                    'USA': 9.631e+06,
                    'China': 9.597e+06,
                    'Brazil': 8.515e+06,
                    'Australia': 7.741e+06,
                    'India': 3.287e+06,
                    'Argentina': 2.767e+06,
                    'Kazakhstan': 2.725e+06,
                    'Algeria': 2.382e+06}

In [11]:
country_area = pd.Series(country_area_dict)

In [12]:
country_pops / country_area  # diff sized Series are automatically aligned by indices (NaNs are automatically supplied)

Algeria              NaN
Argentina            NaN
Australia            NaN
Bangladesh           NaN
Brazil         24.075161
Canada               NaN
China         142.752944
India         389.412838
Indonesia            NaN
Japan                NaN
Kazakhstan           NaN
Nigeria              NaN
Pakistan             NaN
Russia          8.606557
USA            33.433704
dtype: float64

In [13]:
country_pops.name = 'Country population'  # Series can have a name

In [14]:
country_pops.index.name = 'Country'  # so can its index

In [15]:
print country_pops

Country
Bangladesh     159000000
Brazil         205000000
China         1370000000
India         1280000000
Indonesia      257000000
Japan          127000000
Nigeria        183000000
Pakistan       191000000
Russia         147000000
USA            322000000
Name: Country population, dtype: float64

In [16]:
ser1 = pd.Series([1, 2, 3], index=['a', 'b', 'c'])  # can also creates Series from lists

In [17]:
print ser1

a    1
b    2
c    3
dtype: int64

In [18]:
country_pops.index = [name.upper() for name in country_pops.index]  # index can be modified

In [19]:
print country_pops  # now country names are in capitalized (note that index.name got deleted)

BANGLADESH     159000000
BRAZIL         205000000
CHINA         1370000000
INDIA         1280000000
INDONESIA      257000000
JAPAN          127000000
NIGERIA        183000000
PAKISTAN       191000000
RUSSIA         147000000
USA            322000000
Name: Country population, dtype: float64

In [20]:
country_pops.sort()  # sort in place based on values

In [21]:
print country_pops

JAPAN          127000000
RUSSIA         147000000
BANGLADESH     159000000
NIGERIA        183000000
PAKISTAN       191000000
BRAZIL         205000000
INDONESIA      257000000
USA            322000000
INDIA         1280000000
CHINA         1370000000
Name: Country population, dtype: float64

In [22]:
country_pops.sort_index()  # return a copy with indices in sorted order

BANGLADESH     159000000
BRAZIL         205000000
CHINA         1370000000
INDIA         1280000000
INDONESIA      257000000
JAPAN          127000000
NIGERIA        183000000
PAKISTAN       191000000
RUSSIA         147000000
USA            322000000
Name: Country population, dtype: float64

In [23]:
country_pops  # original Series is still sorted by values

JAPAN          127000000
RUSSIA         147000000
BANGLADESH     159000000
NIGERIA        183000000
PAKISTAN       191000000
BRAZIL         205000000
INDONESIA      257000000
USA            322000000
INDIA         1280000000
CHINA         1370000000
Name: Country population, dtype: float64

# DataFrame

Let us read in the famous [Iris data set](http://en.wikipedia.org/wiki/Iris_flower_data_set#Data_set) from the pandas github repository.

`pd.read_csv()` return a Pandas DataFrame object. Note that we can read a file directly using its URL.

In [24]:
iris_data = pd.read_csv('https://raw.githubusercontent.com/pydata/pandas/master/pandas/tests/data/iris.csv')

In [25]:
iris_data.head(10)  # first 10 rows

   SepalLength  SepalWidth  PetalLength  PetalWidth         Name
0          5.1         3.5          1.4         0.2  Iris-setosa
1          4.9         3.0          1.4         0.2  Iris-setosa
2          4.7         3.2          1.3         0.2  Iris-setosa
3          4.6         3.1          1.5         0.2  Iris-setosa
4          5.0         3.6          1.4         0.2  Iris-setosa
5          5.4         3.9          1.7         0.4  Iris-setosa
6          4.6         3.4          1.4         0.3  Iris-setosa
7          5.0         3.4          1.5         0.2  Iris-setosa
8          4.4         2.9          1.4         0.2  Iris-setosa
9          4.9         3.1          1.5         0.1  Iris-setosa

In [26]:
iris_data.columns  # columns attribute has columns names

Index([u'SepalLength', u'SepalWidth', u'PetalLength', u'PetalWidth', u'Name'], dtype='object')

Note that column names are stored as [Python unicode strings](https://docs.python.org/2/howto/unicode.html#the-unicode-type).

In [27]:
iris_data['SepalLength']  # returns a column as pd.Series

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
5      5.4
6      4.6
7      5.0
8      4.4
9      4.9
10     5.4
11     4.8
12     4.8
13     4.3
14     5.8
15     5.7
16     5.4
17     5.1
18     5.7
19     5.1
20     5.4
21     5.1
22     4.6
23     5.1
24     4.8
25     5.0
26     5.0
27     5.2
28     5.2
29     4.7
      ...
120    6.9
121    5.6
122    7.7
123    6.3
124    6.7
125    7.2
126    6.2
127    6.1
128    6.4
129    7.2
130    7.4
131    7.9
132    6.4
133    6.3
134    6.1
135    7.7
136    6.3
137    6.4
138    6.0
139    6.9
140    6.7
141    6.9
142    5.8
143    6.8
144    6.7
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: SepalLength, dtype: float64

In [28]:
iris_data.Name  # columns can also be accessed as attributes

0         Iris-setosa
1         Iris-setosa
2         Iris-setosa
3         Iris-setosa
4         Iris-setosa
5         Iris-setosa
6         Iris-setosa
7         Iris-setosa
8         Iris-setosa
9         Iris-setosa
10        Iris-setosa
11        Iris-setosa
12        Iris-setosa
13        Iris-setosa
14        Iris-setosa
15        Iris-setosa
16        Iris-setosa
17        Iris-setosa
18        Iris-setosa
19        Iris-setosa
20        Iris-setosa
21        Iris-setosa
22        Iris-setosa
23        Iris-setosa
24        Iris-setosa
25        Iris-setosa
26        Iris-setosa
27        Iris-setosa
28        Iris-setosa
29        Iris-setosa
            ...
120    Iris-virginica
121    Iris-virginica
122    Iris-virginica
123    Iris-virginica
124    Iris-virginica
125    Iris-virginica
126    Iris-virginica
127    Iris-virginica
128    Iris-virginica
129    Iris-virginica
130    Iris-virginica
131    Iris-virginica
132    Iris-virginica
133    Iris-virginica
134    Iris-virginica
135    Iris-virginica
136    Iris-virginica
137    Iris-virginica
138    Iris-virginica
139    Iris-virginica
140    Iris-virginica
141    Iris-virginica
142    Iris-virginica
143    Iris-virginica
144    Iris-virginica
145    Iris-virginica
146    Iris-virginica
147    Iris-virginica
148    Iris-virginica
149    Iris-virginica
Name: Name, dtype: object

In [29]:
iris_data.head(10)[[0, 2]]  # columns 0 (SepalLength) and 2 (PetalLength)

   SepalLength  PetalLength
0          5.1          1.4
1          4.9          1.4
2          4.7          1.3
3          4.6          1.5
4          5.0          1.4
5          5.4          1.7
6          4.6          1.4
7          5.0          1.5
8          4.4          1.4
9          4.9          1.5

However, *slicing and boolean indexing extracts rows*, not columns. You will probably find this a bit inconsistent but that's the way it is.

In [30]:
iris_data.head(10)[:2]  # rows 0 through 2 (2 excluded), not columns

   SepalLength  SepalWidth  PetalLength  PetalWidth         Name
0          5.1         3.5          1.4         0.2  Iris-setosa
1          4.9         3.0          1.4         0.2  Iris-setosa

In [31]:
# return rows where PetalLength is at least 90% of the maximum PetalLength
iris_data[iris_data['PetalLength'] > 0.9*np.max(iris_data['PetalLength'])]

     SepalLength  SepalWidth  PetalLength  PetalWidth            Name
105          7.6         3.0          6.6         2.1  Iris-virginica
107          7.3         2.9          6.3         1.8  Iris-virginica
117          7.7         3.8          6.7         2.2  Iris-virginica
118          7.7         2.6          6.9         2.3  Iris-virginica
122          7.7         2.8          6.7         2.0  Iris-virginica
131          7.9         3.8          6.4         2.0  Iris-virginica

In [32]:
iris_data.ix[[11, 22, 33]]  # rows 11, 22, and 33 (note the use of the ix() method)

    SepalLength  SepalWidth  PetalLength  PetalWidth         Name
11          4.8         3.4          1.6         0.2  Iris-setosa
22          4.6         3.6          1.0         0.2  Iris-setosa
33          5.5         4.2          1.4         0.2  Iris-setosa

In [33]:
names = iris_data['Name']  # extract Name column
del iris_data['Name']  # delete Name column
iris_data.head(10)

   SepalLength  SepalWidth  PetalLength  PetalWidth
0          5.1         3.5          1.4         0.2
1          4.9         3.0          1.4         0.2
2          4.7         3.2          1.3         0.2
3          4.6         3.1          1.5         0.2
4          5.0         3.6          1.4         0.2
5          5.4         3.9          1.7         0.4
6          4.6         3.4          1.4         0.3
7          5.0         3.4          1.5         0.2
8          4.4         2.9          1.4         0.2
9          4.9         3.1          1.5         0.1

In [34]:
iris_data['Species'] = names  # put it back bt with a different column name

In [35]:
iris_data.ix[[11, 22, 33]][['PetalWidth', 'Species']]  # rows 11, 22, 33 and columns PetalWidth and Species

    PetalWidth      Species
11         0.2  Iris-setosa
22         0.2  Iris-setosa
33         0.2  Iris-setosa

In [36]:
iris_data.ix[[11, 22, 33], ['PetalWidth', 'Species']]  # another way, a bit shorter

    PetalWidth      Species
11         0.2  Iris-setosa
22         0.2  Iris-setosa
33         0.2  Iris-setosa

In [37]:
iris_data.head()  # default arg for head() is 5

   SepalLength  SepalWidth  PetalLength  PetalWidth      Species
0          5.1         3.5          1.4         0.2  Iris-setosa
1          4.9         3.0          1.4         0.2  Iris-setosa
2          4.7         3.2          1.3         0.2  Iris-setosa
3          4.6         3.1          1.5         0.2  Iris-setosa
4          5.0         3.6          1.4         0.2  Iris-setosa

In [38]:
iris_vals = iris_data.values  # just the numeric values in the DataFrame, returned as a numpy array

In [39]:
print type(iris_vals)

<type 'numpy.ndarray'>

In [40]:
iris_vals.shape

(150, 5)

In [41]:
iris_data.ix[:, :4].sum()  # sums of all columns from 0 through 4 (now excluded since we're using ix())

SepalLength    876.5
SepalWidth     458.1
PetalLength    563.8
PetalWidth     179.8
dtype: float64

In [42]:
iris_data.ix[:, :4].mean()  # means of the same columns

SepalLength    5.843333
SepalWidth     3.054000
PetalLength    3.758667
PetalWidth     1.198667
dtype: float64

In [43]:
iris_data.ix[:6, :4]  # rows 1 thru 6 (excluded) and cols 0 thru 4 (excluded)

   SepalLength  SepalWidth  PetalLength  PetalWidth
0          5.1         3.5          1.4         0.2
1          4.9         3.0          1.4         0.2
2          4.7         3.2          1.3         0.2
3          4.6         3.1          1.5         0.2
4          5.0         3.6          1.4         0.2
5          5.4         3.9          1.7         0.4
6          4.6         3.4          1.4         0.3

In [44]:
iris_data.ix[:6, :4].mean(axis=1)  # take mean across axis 1, i.e. horizontal

0    2.550
1    2.375
2    2.350
3    2.350
4    2.550
5    2.850
6    2.425
dtype: float64

In [45]:
# create a DataFrame with duplicate column names and row index values
df = pd.DataFrame(np.random.randn(3, 5), columns=['one', 'two', 'three', 'fournfive', 'fournfive'],
                  index=['John','John','Mike'])

In [46]:
df

           one       two     three  fournfive  fournfive
John  1.411650 -2.427067  0.399238   0.626236   1.314135
John  0.285700  0.568812  2.300580  -1.616372   1.519371
Mike  0.398088 -1.304276 -0.345632   1.196869  -0.093849

In [47]:
df.ix['John']  # returns all rows with index 'John'

          one       two     three  fournfive  fournfive
John  1.41165 -2.427067  0.399238   0.626236   1.314135
John  0.28570  0.568812  2.300580  -1.616372   1.519371

In [48]:
df['fournfive']  # returns all columns with index 'fournfive'

      fournfive  fournfive
John   0.626236   1.314135
John  -1.616372   1.519371
Mike   1.196869  -0.093849

In [49]:
df.T  # transpose

               John      John      Mike
one        1.411650  0.285700  0.398088
two       -2.427067  0.568812 -1.304276
three      0.399238  2.300580 -0.345632
fournfive  0.626236 -1.616372  1.196869
fournfive  1.314135  1.519371 -0.093849

In [50]:
df.ix[['John'], ['one', 'three']] = np.nan  # introduce missing values (NaN = Not A Number)

In [51]:
df

           one       two     three  fournfive  fournfive
John       NaN -2.427067       NaN   0.626236   1.314135
John       NaN  0.568812       NaN  -1.616372   1.519371
Mike  0.398088 -1.304276 -0.345632   1.196869  -0.093849

In [52]:
df.isnull()  # return booleans indicating where the missing values are

        one    two  three fournfive fournfive
John   True  False   True     False     False
John   True  False   True     False     False
Mike  False  False  False     False     False

In [53]:
df.notnull()  # boolean complement of isnull()

        one   two  three fournfive fournfive
John  False  True  False      True      True
John  False  True  False      True      True
Mike   True  True   True      True      True

In [54]:
df.dropna()  # returns a copy with rows containing missing vals dropped

           one       two     three  fournfive  fournfive
Mike  0.398088 -1.304276 -0.345632   1.196869  -0.093849

In [55]:
df.dropna(axis=1)  # drop cols containing missing vals

           two  fournfive  fournfive
John -2.427067   0.626236   1.314135
John  0.568812  -1.616372   1.519371
Mike -1.304276   1.196869  -0.093849

In [56]:
df.fillna(0)  # returns a copy with missing vals replaced by 0

           one       two     three  fournfive  fournfive
John  0.000000 -2.427067  0.000000   0.626236   1.314135
John  0.000000  0.568812  0.000000  -1.616372   1.519371
Mike  0.398088 -1.304276 -0.345632   1.196869  -0.093849

In [57]:
df  # as we said, dropna() and fillna() return copies

           one       two     three  fournfive  fournfive
John       NaN -2.427067       NaN   0.626236   1.314135
John       NaN  0.568812       NaN  -1.616372   1.519371
Mike  0.398088 -1.304276 -0.345632   1.196869  -0.093849

In [58]:
df.ix[['Mike'], ['two', 'fournfive']] = np.nan  # introduce 3 mores NaNs in Mike's row
df

           one       two     three  fournfive  fournfive
John       NaN -2.427067       NaN   0.626236   1.314135
John       NaN  0.568812       NaN  -1.616372   1.519371
Mike  0.398088       NaN -0.345632        NaN        NaN

In [59]:
df.dropna(thresh=3)  # return rows with 3 or more non-NaN values; so Mike gets dropped

      one       two  three  fournfive  fournfive
John  NaN -2.427067    NaN   0.626236   1.314135
John  NaN  0.568812    NaN  -1.616372   1.519371

# Panel

[Panel data](http://en.wikipedia.org/wiki/Panel_data) is an econometric term (for what would be called Longitudinal data in other fields such as Biostatistics or Social Sciences).

Pandas, the name of the Python module we're studying, is itself partly derived from Pan[el]-da[ta]-s.

In [60]:
vals1 = np.array([[60000, 29],
                  [45000, 45],
                  [70000, 35]])

In [61]:
df1 = pd.DataFrame(vals1, columns=['income','age'], index=['Mike', 'John', 'Jane'])

In [62]:
df1

      income  age
Mike   60000   29
John   45000   45
Jane   70000   35

In [63]:
vals2 = np.array([[61000, 30],
                  [46000, 46],
                  [73000, 36]])
vals3 = np.array([[63000, 31],
                  [47000, 47],
                  [74000, 37]])

In [64]:
df2 = pd.DataFrame(vals2, columns=['income','age'], index=['Mike', 'John', 'Jane'])
df3 = pd.DataFrame(vals3, columns=['income','age'], index=['Mike', 'John', 'Jane'])

In [65]:
panel = pd.Panel({'2010': df1, '2011': df2, '2012': df3})

In [66]:
panel

<class 'pandas.core.panel.Panel'>
Dimensions: 3 (items) x 3 (major_axis) x 2 (minor_axis)
Items axis: 2010 to 2012
Major_axis axis: Mike to Jane
Minor_axis axis: income to age

You can think of a Panel as stacked up DataFrames. The `items` axis (axis 0) gives individual DataFrames, the `major` axis (axis 1) corresponds to index (rows) of individual DataFrames, and the `minor` axis corresponds to columns of individual DataFrames.

In [67]:
panel['2011']  # df for year 2011

      income  age
Mike   61000   30
John   46000   46
Jane   73000   36

In [68]:
panel.ix['2011':'2012']  # a sub-panel with data only for years 2011 and 2012

<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 3 (major_axis) x 2 (minor_axis)
Items axis: 2011 to 2012
Major_axis axis: Mike to Jane
Minor_axis axis: income to age

In [69]:
panel.ix[:, 'Jane', :]  # Jane's data only

         2010   2011   2012
income  70000  73000  74000
age        35     36     37

In [70]:
panel.ix['2011', 'Mike':'John', :]  # Mike thru John's data for the year 2011

      income  age
Mike   61000   30
John   46000   46

In [71]:
another_panel = panel.ix['2011':, 'John':, :]  # sub-panel with data for years 2011 and onwards, for John and Jane
another_panel

<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 2 (major_axis) x 2 (minor_axis)
Items axis: 2011 to 2012
Major_axis axis: John to Jane
Minor_axis axis: income to age

As the [pandas documentation](http://pandas.pydata.org/pandas-docs/stable/dsintro.html#from-dict-of-dataframe-objects) says:
    
"Unfortunately Panel, being less commonly used than Series and DataFrame, has been slightly neglected feature-wise. A number of methods and options available in DataFrame are not available in Panel. This will get worked on, of course, in future releases. And faster if you join me in working on the codebase."